## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_dns_zone.dev will be created
  + resource "azurerm_dns_zone" "dev" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.equal.vote"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "equalvote"
    }

  # azurerm_dns_zone.prod will be created
  + resource "azurerm_dns_zone" "prod" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "prod.equal.vote"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "equalvote"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>